# ProfileParamAlongPath Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ProfileParamAlongPath Property
ParameterTypeId Class See Also
---
"Parameter along path"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ProfileParamAlongPath { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ProfileParamAlongPath As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ProfileParamAlongPath {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace